## Production: cloudfront
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 25 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                             NAME                                             |
|--------|----------------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.url_shortener_certificate`                                              |
|        | `aws_acm_certificate_validation.url_shortener_certificate_validation`                        |
|        | `aws_cloudfront_distribution.url_shortener_api`                                              |
|        | `aws_cloudfront_response_headers_policy.security_headers_api`                                |
|        | `aws_iam_policy.write_waf_logs`                                                              |
|        | `aws_iam_role.waf_log_role`                                                                  |
|        | `aws_iam_role_policy_attachment.write_waf_logs`                                              |
|        | `aws_kinesis_firehose_delivery_stream.api`                                                   |
|        | `aws_route53_record.url_shortener_A`                                                         |
|        | `aws_route53_record.url_shortener_dns_validation[&quot;*.o.alpha.canada.ca&quot;]`                     |
|        | `aws_route53_record.url_shortener_dns_validation[&quot;o.alpha.canada.ca&quot;]`                       |
|        | `aws_wafv2_regex_pattern_set.login_uri_paths`                                                |
|        | `aws_wafv2_regex_pattern_set.valid_uri_paths`                                                |
|        | `aws_wafv2_web_acl.api_waf`                                                                  |
|        | `aws_wafv2_web_acl_logging_configuration.api`                                                |
|        | `module.resolver_dns.aws_cloudwatch_log_group.route53_vpc_dns`                               |
|        | `module.resolver_dns.aws_cloudwatch_log_resource_policy.route53_vpc_dns`                     |
|        | `module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0]`                   |
|        | `module.resolver_dns.aws_route53_resolver_firewall_domain_list.blocked[0]`                   |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule.allowed[0]`                          |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule.blocked[0]`                          |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule_group.firewall_rules[0]`             |
|        | `module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]` |
|        | `module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns`                  |
|        | `module.resolver_dns.aws_route53_resolver_query_log_config_association.route53_vpc_dns`      |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/url-shortener/actions/runs/4801434108).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # aws_acm_certificate.url_shortener_certificate will be created
  + resource "aws_acm_certificate" "url_shortener_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "o.alpha.canada.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.o.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "o.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.o.alpha.canada.ca",
          + "o.alpha.canada.ca",
        ]
      + tags                      = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all                  = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = (known after apply)
        }
    }

  # aws_acm_certificate_validation.url_shortener_certificate_validation will be created
  + resource "aws_acm_certificate_validation" "url_shortener_certificate_validation" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.url_shortener_api will be created
  + resource "aws_cloudfront_distribution" "url_shortener_api" {
      + aliases                        = [
          + "o.alpha.canada.ca",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all                       = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true
      + web_acl_id                     = (known after apply)

      + default_cache_behavior {
          + allowed_methods            = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cache_policy_id            = "4135ea2d-6df8-44a3-9df3-4b5a84be39ad"
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = (known after apply)
          + max_ttl                    = (known after apply)
          + min_ttl                    = 0
          + origin_request_policy_id   = "b689b0a8-53d0-40ab-baf2-68738e2966ac"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "url-shortener-api"
          + trusted_key_groups         = (known after apply)
          + trusted_signers            = (known after apply)
          + viewer_protocol_policy     = "redirect-to-https"
        }

      + ordered_cache_behavior {
          + allowed_methods            = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods             = [
              + "GET",
              + "HEAD",
            ]
          + compress                   = true
          + default_ttl                = 0
          + max_ttl                    = 0
          + min_ttl                    = 0
          + path_pattern               = "/healthcheck"
          + response_headers_policy_id = (known after apply)
          + target_origin_id           = "url-shortener-api"
          + viewer_protocol_policy     = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward = "none"
                }
            }
        }

      + origin {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1.2_2021"
          + ssl_support_method       = "sni-only"
        }
    }

  # aws_cloudfront_response_headers_policy.security_headers_api will be created
  + resource "aws_cloudfront_response_headers_policy" "security_headers_api" {
      + etag = (known after apply)
      + id   = (known after apply)
      + name = "url-shortener-security-headers-api"

      + security_headers_config {
          + content_security_policy {
              + content_security_policy = "report-uri https://csp-report-to.security.cdssandbox.xyz/report; default-src 'none'; script-src 'self' 'unsafe-inline' https://unpkg.com/@cdssnc/ https://o.alpha.canada.ca/static/js/ https://kit.fontawesome.com; font-src 'self' https://fonts.googleapis.com https://fonts.gstatic.com https://kit.fontawesome.com https://ka-f.fontawesome.com https://unpkg.com/font-awesome@4.7.0/; connect-src 'self' https://ka-f.fontawesome.com; img-src 'self' https://o.alpha.canada.ca/static/img/ data: w3.org/svg/2000; style-src 'self' 'unsafe-inline' https://o.alpha.canada.ca/static/css/ https://unpkg.com/@cdssnc/ https://unpkg.com/font-awesome/ https://kit.fontawesome.com https://fonts.googleapis.com; frame-ancestors 'self'; form-action 'self';"
              + override                = false
            }

          + content_type_options {
              + override = true
            }

          + frame_options {
              + frame_option = "DENY"
              + override     = true
            }

          + referrer_policy {
              + override        = true
              + referrer_policy = "same-origin"
            }

          + strict_transport_security {
              + access_control_max_age_sec = 31536000
              + include_subdomains         = true
              + override                   = true
              + preload                    = true
            }

          + xss_protection {
              + mode_block = true
              + override   = true
              + protection = true
            }
        }
    }

  # aws_iam_policy.write_waf_logs will be created
  + resource "aws_iam_policy" "write_waf_logs" {
      + arn         = (known after apply)
      + description = "Allow Firehose to write WAF logs to S3"
      + id          = (known after apply)
      + name        = "url-shortener-waf-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-806721586252"
                      + Sid      = ""
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject*",
                          + "s3:GetObject*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cbs-satellite-806721586252/waf_acl_logs/*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.waf_log_role will be created
  + resource "aws_iam_role" "waf_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "url-shortener-waf-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags                  = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.write_waf_logs will be created
  + resource "aws_iam_role_policy_attachment" "write_waf_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "url-shortener-waf-logs"
    }

  # aws_kinesis_firehose_delivery_stream.api will be created
  + resource "aws_kinesis_firehose_delivery_stream" "api" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-url-shortener"
      + tags           = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-806721586252"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/806721586252/"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled = false
            }
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_route53_record.url_shortener_A will be created
  + resource "aws_route53_record" "url_shortener_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "o.alpha.canada.ca"
      + type            = "A"
      + zone_id         = "Z0129461HK2TKOF3BTTF"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_route53_record.url_shortener_dns_validation["*.o.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "url_shortener_dns_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0129461HK2TKOF3BTTF"
    }

  # aws_route53_record.url_shortener_dns_validation["o.alpha.canada.ca"] will be created
  + resource "aws_route53_record" "url_shortener_dns_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z0129461HK2TKOF3BTTF"
    }

  # aws_wafv2_regex_pattern_set.login_uri_paths will be created
  + resource "aws_wafv2_regex_pattern_set" "login_uri_paths" {
      + arn         = (known after apply)
      + description = "Regex to match the login paths of the API"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "login-uri-paths"
      + scope       = "CLOUDFRONT"
      + tags        = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }

      + regular_expression {
          + regex_string = "^/en/(login|magic-link)/?$"
        }
      + regular_expression {
          + regex_string = "^/fr/(connexion|lien-magique)/?$"
        }
    }

  # aws_wafv2_regex_pattern_set.valid_uri_paths will be created
  + resource "aws_wafv2_regex_pattern_set" "valid_uri_paths" {
      + arn         = (known after apply)
      + description = "Regex to match the valid paths of hte API"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "valid-api-paths"
      + scope       = "CLOUDFRONT"
      + tags        = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }

      + regular_expression {
          + regex_string = "^/(version|healthcheck|openapi.json|.well-known/security.txt)$"
        }
      + regular_expression {
          + regex_string = "^/?(en|fr)?/?$"
        }
      + regular_expression {
          + regex_string = "^/[0-9A-Za-z]{8}/?$"
        }
      + regular_expression {
          + regex_string = "^/en/(login|logout|contact|magic-link)/?$"
        }
      + regular_expression {
          + regex_string = "^/fr/(connexion|deconnexion|contact|lien-magique)/?$"
        }
      + regular_expression {
          + regex_string = "^/lang/(en|fr)/?$"
        }
      + regular_expression {
          + regex_string = "^/static/(css|js|img)/[^/]+$"
        }
      + regular_expression {
          + regex_string = "^/v1/?$"
        }
    }

  # aws_wafv2_web_acl.api_waf will be created
  + resource "aws_wafv2_web_acl" "api_waf" {
      + arn         = (known after apply)
      + capacity    = (known after apply)
      + description = "WAF for URL shortener API"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "url-shortener-waf"
      + scope       = "CLOUDFRONT"
      + tags        = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }

      + custom_response_body {
          + content      = jsonencode(
                {
                  + detail = {
                      + error  = "Request blocked."
                      + status = "ERROR"
                    }
                }
            )
          + content_type = "APPLICATION_JSON"
          + key          = "json_request_blocked_error_response"
        }
      + custom_response_body {
          + content      = jsonencode(
                {
                  + detail = {
                      + error  = "Too many requests."
                      + status = "ERROR"
                    }
                }
            )
          + content_type = "APPLICATION_JSON"
          + key          = "json_request_rate_limited_error_response"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "APIInvalidPath"
          + priority = 5

          + action {

              + block {
                  + custom_response {
                      + custom_response_body_key = "json_request_blocked_error_response"
                      + response_code            = 403
                    }
                }
            }

          + statement {

              + not_statement {
                  + statement {

                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {

                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "APIInvalidPaths"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "APIRateLimit"
          + priority = 20

          + action {

              + block {
                  + custom_response {
                      + custom_response_body_key = "json_request_rate_limited_error_response"
                      + response_code            = 429
                    }
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 2000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "APIRateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "LoginAPIRateLimit"
          + priority = 25

          + action {

              + block {
                  + custom_response {
                      + custom_response_body_key = "json_request_rate_limited_error_response"
                      + response_code            = 429
                    }
                }
            }

          + statement {

              + rate_based_statement {
                  + aggregate_key_type = "IP"
                  + limit              = 100

                  + scope_down_statement {

                      + regex_pattern_set_reference_statement {
                          + arn = (known after apply)

                          + field_to_match {

                              + uri_path {}
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "LoginAPIRateLimit"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 10

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesCommonRuleSet"
          + priority = 30

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesCommonRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 40

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesLinuxRuleSet"
          + priority = 50

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesLinuxRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesLinuxRuleSet"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "api"
          + sampled_requests_enabled   = false
        }
    }

  # aws_wafv2_web_acl_logging_configuration.api will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "api" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = (known after apply)
    }

  # module.resolver_dns.data.aws_iam_policy_document.route53_resolver_logging_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "route53_resolver_logging_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "route53.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.resolver_dns.aws_cloudwatch_log_group.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_group" "route53_vpc_dns" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/route53/url_shortener_vpc_id"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all          = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_cloudwatch_log_resource_policy.route53_vpc_dns will be created
  + resource "aws_cloudwatch_log_resource_policy" "route53_vpc_dns" {
      + id              = (known after apply)
      + policy_document = (known after apply)
      + policy_name     = "route53_resolver_logging_policy"
    }

  # module.resolver_dns.aws_route53_resolver_firewall_domain_list.allowed[0] will be created
  + resource "aws_route53_resolver_firewall_domain_list" "allowed" {
      + arn      = (known after apply)
      + domains  = [
          + "*.akamaiedge.net.",
          + "*.amazonaws.com.",
          + "*.canada.ca.",
          + "*.edgekey.net.",
          + "*.gc.ca.",
          + "*.gg.ca.",
          + "canada.ca.",
          + "gg.ca.",
        ]
      + id       = (known after apply)
      + name     = "AllowedDomains"
      + tags     = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_domain_list.blocked[0] will be created
  + resource "aws_route53_resolver_firewall_domain_list" "blocked" {
      + arn      = (known after apply)
      + domains  = [
          + "*.",
        ]
      + id       = (known after apply)
      + name     = "BlockedDomains"
      + tags     = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule.allowed[0] will be created
  + resource "aws_route53_resolver_firewall_rule" "allowed" {
      + action                  = "ALLOW"
      + firewall_domain_list_id = (known after apply)
      + firewall_rule_group_id  = (known after apply)
      + id                      = (known after apply)
      + name                    = "AllowedDomains"
      + priority                = 100
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule.blocked[0] will be created
  + resource "aws_route53_resolver_firewall_rule" "blocked" {
      + action                  = "BLOCK"
      + block_response          = "NODATA"
      + firewall_domain_list_id = (known after apply)
      + firewall_rule_group_id  = (known after apply)
      + id                      = (known after apply)
      + name                    = "BlockedDomains"
      + priority                = 200
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule_group.firewall_rules[0] will be created
  + resource "aws_route53_resolver_firewall_rule_group" "firewall_rules" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "FirewallRules"
      + owner_id     = (known after apply)
      + share_status = (known after apply)
      + tags         = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "url-shortener-production"
          + "Terraform"  = "true"
        }
    }

  # module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0] will be created
  + resource "aws_route53_resolver_firewall_rule_group_association" "firewall_rules" {
      + arn                    = (known after apply)
      + firewall_rule_group_id = (known after apply)
      + id                     = (known after apply)
      + mutation_protection    = (known after apply)
      + name                   = "FirewallRules"
      + priority               = 101
      + tags_all               = (known after apply)
      + vpc_id   ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_firewall_rule_group_association.firewall_rules[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.resolver_dns.aws_route53_resolver_query_log_config.route53_vpc_dns"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
